# HasEnded Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransactionGroup..::..HasEnded Method
TransactionGroup Class See Also
---
Determines whether the transaction group has ended already.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool HasEnded()
```

Visual Basic
---
```text
Public Function HasEnded As Boolean
```

Visual C++
---
```text
public:
bool HasEnded()
```

# ### Return Value
True if the transaction group has already been committed or rolled back, False otherwise.
# Remarks
A transaction is ended by completing either the Commit or RollBack or Assimilate method. Another way of testing whether a transaction group has ended is by testing its current status returned from (see GetStatus()()()()). It must be either 'TransactionStatus.Committed' or 'TransactionStatus.RolledBack'
# See Also
TransactionGroup Class
Autodesk.Revit.DB Namespace